app/views/shelters/show.html.erb

  <h3>Shelter Statistics</h3>
  <h4>Pet Count: <%= @shelter.pets.count %></h4>
  <h4>Average Review Rating: <%= @shelter.reviews.average(:rating).to_i %></h4>
---
SELECT COUNT(*) FROM "pets" INNER JOIN "pet_adopts" ON "pet_adopts"."pet_id" = "pets"."id" INNER JOIN "adopts" ON "adopts"."id" = "pet_adopts"."adopt_id" WHERE "pets"."shelter_id" = $1  [["shelter_id", 2]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."shelter_id" = $1  [["shelter_id", 26]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."shelter_id" = $1  [["shelter_id", 2]]