app/views/favorites/index.html.erb

<% if favorite_pets %>
  <% favorite_pets.pets.each do |id, info_hash| %>
---
SELECT pets.id, pets.name FROM "pets" INNER JOIN "pet_adopts" ON "pet_adopts"."pet_id" = "pets"."id" INNER JOIN "adopts" ON "adopts"."id" = "pet_adopts"."adopt_id"