app/controllers/adopts_controller.rb

INSERT INTO "adopts" ("name", "address", "city", "state", "phone", "description", "zip") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Lauren Steitle"], ["address", "3290 S Huron St"], ["city", "Englewood"], ["state", "Colorado"], ["phone", "5129650953"], ["description", "the best dog"], ["zip", "80110"]]
---
  def create
    @application_params = adopt_params
    @adopt_pets = pets_params
    adopt = Adopt.new(@application_params)
    if adopt.save

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def index
    pet = Pet.find_by(id: params[:id])

SELECT  "adopts".* FROM "adopts" WHERE "adopts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @adopt = Adopt.find(params[:id])
    @name = @adopt.name
    adopt_pets = PetAdopt.where(adopt_id: @adopt.id).pluck(:pet_id)
    @pets = Pet.where(id: adopt_pets)