app/controllers/favorites_controller.rb

  def create
    favorite = Favorite.create(pet_id: params[:pet_id])
---
INSERT INTO "favorites" ("pet_id") VALUES ($1) RETURNING "id"  [["pet_id", 1]]

  def index
    if Favorite.count > 0
---
SELECT "favorites".* FROM "favorites"
SELECT COUNT(*) FROM "favorites"

  def destroy
    if params[:id]
      Favorite.destroy(params[:id])
---
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 21]]