app/controllers/pets_controller.rb

  def index
    if params[:shelter_id]
      @shelter = Shelter.find(params[:shelter_id])
      @pets = @shelter.pets
    else
      @pets = Pet.all
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 1]]

  def new
    @shelter = Shelter.find(params[:shelter_id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @shelter = Shelter.find(params[:shelter_id])
    pet = @shelter.pets.create(pet_params)
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "pets" ("name", "approximate_age", "sex", "shelter_id", "image", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    @pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    pet = Pet.find(params[:id])
    pet.update(pet_params)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "pets" SET "name" = $1, "description" = $2, "approximate_age" = $3, "sex" = $4 WHERE "pets"."id" = $5  [["name", "Spuds"], ["description", "A cute cuddly pup!"], ["approximate_age", 3], ["sex", "Male"], ["id", 3]]

  def destroy
    @favs.pets.delete(params[:id])
---
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 2]]