app/controllers/reviews_controller.rb

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 177], ["LIMIT", 1]]
---
  def new
    @shelter = Shelter.find(params[:shelter_id])

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 178], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "rating", "content", "shelter_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "WOW! AWESOME SHELTER!"], ["rating", 5], ["content", "I adopted my friendly pups from here!"], ["shelter_id", 178]]
---
  def create
    @shelter = Shelter.find(params[:shelter_id])
    review = @shelter.reviews.create(review_params)

DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 13]]
---
  def destroy
    Review.destroy(params[:review_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def edit
    @shelter_id = params[:shelter_id]
    @review = Review.find(params[:review_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
UPDATE "reviews" SET "title" = $1, "rating" = $2, "content" = $3 WHERE "reviews"."id" = $4  [["title", "No Thanks!"], ["rating", 1], ["content", "I had to wait 27 seconds for the attendant to say Hi to me! Outrageous!"], ["id", 41]]
---
def update
  review = Review.find(params[:review_id])
  review.update(review_params)