app/controllers/shelters_controller.rb

  def index
    @shelters = Shelter.all
---
SELECT "shelters".* FROM "shelters"

  def create
    shelter = Shelter.new(shelter_params)
      if shelter.save
---
INSERT INTO "shelters" ("name", "address", "city", "state", "zip") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "New shelter!"], ["address", "123 Main St"], ["city", "Denver"], ["state", "CO"], ["zip", "80206"]]

  def show
    @shelter = Shelter.find(params[:id])
    @reviews = @shelter.reviews
    @count_of_adoptions = @shelter.find_adoptions
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."shelter_id" = $1  [["shelter_id", 26]]

  def edit
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

  def update
    shelter = Shelter.find(params[:id])
    shelter.update(shelter_params)
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "shelters" SET "name" = $1, "address" = $2, "city" = $3, "state" = $4, "zip" = $5 WHERE "shelters"."id" = $6  [["name", "Denver Cat Shelter"], ["address", "123 Cat St"], ["city", "Colorado Springs"], ["state", "Nevada"], ["zip", "80202"], ["id", 18]]

  def destroy
    Shelter.destroy(params[:id])
---
DELETE FROM "shelters" WHERE "shelters"."id" = $1  [["id", 28]]